doorSwitch/doorSwtichBus-case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              1.5e-05;

// Thermal expansion coefficient
beta            3e-03;

// Reference temperature
TRef            293;

// Laminar Prandtl number and Schmidt number
Pr              0.71;
Sc 				1;

// Turbulent Prandtl number and Schmidt number
Prt             0.9;
Sct 			1;


// ************************************************************************* //
