doorSwitch/doorSwtichBus-case/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet
    {
        type            prghTotalPressure;
        rho             rhok;
        p0              uniform 0;
    }
    inlet
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    ground
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    star
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    port
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    top
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    interior
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    exterior
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    seats
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    exhaust
    {
        // type            prghTotalPressure;
        // rho             rhok;
        // p0              uniform 0;
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    rails
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    vents
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    driver
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    standingFwd
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    standingRear
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    mouthDriver
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    mouthStandingRear
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    mouthStandingFwd
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    "proc.*"
    {
        type            processor;
    }
}

// ************************************************************************* //
