doorSwitch/doorSwtichBus-case/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.04;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
    }
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.025;
        value           $internalField;
    }
    ground
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.025;
        value           $internalField;
    }
    star
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    port
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    top
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    
    interior
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    exterior
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    seats
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    exhaust
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.025;
        value           $internalField;
    }
    rails
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    vents
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.025;       // 2.5% turbulent intensity
        value           $internalField;
    }
    driver
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    standingFwd
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    standingRear
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    mouthDriver
    {
        // type            inletOutlet;
        // inletValue      $internalField;
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.1;       // 10% turbulent intensity
        value           $internalField;
    }
    mouthStandingRear
    {
        // type            inletOutlet;
        // inletValue      $internalField;
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.1;       // 10% turbulent intensity
        value           $internalField;
    }
    mouthStandingFwd
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.1;       // 10% turbulent intensity
        value           $internalField;
    }
    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
