doorSwitch/doorSwtichBus-case/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    // volScalarFieldValue C           0 
);

regions
(
    // rear door
    boxToCell
    {
        box (-1.65 -1.25 -2.4) (-0.68 -1.15 -0.26);
        fieldValues
        (
            volScalarFieldValue alpha 1e6
        );
    }
    // front door
    boxToCell
    {
        box (4.32 -1.25 -2.4) (5.44 -1.15 -0.38);
        fieldValues
        (
            volScalarFieldValue alpha 1e6
        );
    }
);


// ************************************************************************* //
